tutorials/immersedBoundary/movingCylinderInChannelIco/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    ibCylinder
    {
        type zeroGradientIb;
        patchType immersedBoundary;
        setDeadValue   yes;
        deadValue      0;
        value uniform 0;
    }
    in
    {
        type zeroGradient;
    }
    out
    {
        type fixedValue;
        value uniform 0;
    }
    top
    {
        type zeroGradient;
    }
    bottom
    {
        type zeroGradient;
    }
    frontAndBack
    {
        type empty;
    }
}

// ************************************************************************* //
